app/controllers/posts_controller.rb

INSERT INTO "posts" ("created_at", "text", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sun, 23 Mar 2014 00:23:30 UTC +00:00], ["text", "dfgbfh"], ["title", "kitten"], ["updated_at", Sun, 23 Mar 2014 00:23:30 UTC +00:00]]
---
def create
  @post = Post.new(params[:post].permit(:title, :text, :photo))

  if @post.save